Delans-TLE/src/Catalogs/НомераГТД/НомераГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НомераГТД</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаетсяЗаписьСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТаможенногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазделаИлиТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/НомераГТД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Служебные

Функция ПроверитьКорректностьЗаполненияНомераГТД(СсылкаИлиСтруктура) Экспорт
	Перем Ошибки;
	
	Если СтрДлина(СсылкаИлиСтруктура.КодТаможенногоОргана) <> 2
		И СтрДлина(СсылкаИлиСтруктура.КодТаможенногоОргана) <> 5
		И СтрДлина(СсылкаИлиСтруктура.КодТаможенногоОргана) <> 8 Тогда
		
		ТекстОшибки = НСтр("ru ='Код таможенного органа (первая секция номера) имеет ошибочную длину (допускается 2, 5, 8 символов)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаИлиСтруктура.ДатаПринятия) Тогда
		
		ТекстОшибки = НСтр("ru ='Пустая дата принятия декларации (вторая секция номера)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если СтрДлина(СсылкаИлиСтруктура.ПорядковыйНомер) <> 7 Тогда
		
		ТекстОшибки = НСтр("ru ='Порядковый номер (третья секция номера) имеет ошибочную длину (допускается только 7 символов)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СсылкаИлиСтруктура.НомерРазделаИлиТовара)
		И СтрДлина(СсылкаИлиСтруктура.НомерРазделаИлиТовара) > 3 Тогда
		
		ТекстОшибки = НСтр("ru ='Номер раздела/товара (четвертая секция номера) имеет ошибочную длину (допускается только от 1 до 3 символов)'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Код", ТекстОшибки, "");
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

Функция ДанныеНомераГТД(КодСтрокой, РазделительДекларации = "/") Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КодТаможенногоОргана",	"");
	СтруктураДанных.Вставить("ДатаПринятия",			Дата(1, 1, 1));
	СтруктураДанных.Вставить("ПорядковыйНомер",			"");
	СтруктураДанных.Вставить("НомерРазделаИлиТовара",	"");
	СтруктураДанных.Вставить("РегистрационныйНомер",	"");
	
	МассивСекцийГТД = СтрРазделить(КодСтрокой, РазделительДекларации);
	Если МассивСекцийГТД.Количество() < 3
		ИЛИ МассивСекцийГТД.Количество() > 4 Тогда
		
		СтруктураДанных.Вставить("РегистрационныйНомер", КодСтрокой);
		
	Иначе
		
		СтруктураДанных.КодТаможенногоОргана= СокрЛП(МассивСекцийГТД[0]);
		ДатаПринятияСтрокой					= СокрЛП(МассивСекцийГТД[1]);
		СтруктураДанных.ПорядковыйНомер		= СокрЛП(МассивСекцийГТД[2]);
		
		Если СтрДлина(ДатаПринятияСтрокой) = 6
			И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ДатаПринятияСтрокой) Тогда
			
			СтруктураДанных.ДатаПринятия = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаПринятияСтрокой);
			
		КонецЕсли;
		
		СтруктураДанных.РегистрационныйНомер = СтруктураДанных.КодТаможенногоОргана + РазделительДекларации + ДатаПринятияСтрокой + РазделительДекларации + СтруктураДанных.ПорядковыйНомер;
		
		Если МассивСекцийГТД.Количество() = 4 Тогда
			
			СтруктураДанных.НомерРазделаИлиТовара = СокрЛП(МассивСекцийГТД[3]);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсПечати

// Функция возвращает массив номеров ГТД, которые использовались для указаной номенклатуры
// Если номенклатура не указана. возращается пустой массив.
//
// Параметры:
//	УсловияОтбора - Структура	- Содержит поля отборов.
//	Описание:
//	* Организация (Справочники.Организации) - если не заполнено, выборка происходит по всем организациям;
//	* Номенклатура (Справочники.Номенклатура) - если не заполнено, возращается пустой массив;
//	* Характеристика (Справочники.ХарактеристикиНоменклатуры) - если не заполнено, выбираем все характеристики;
//	* Партия (Справочники.ПартииНоменклатуры) - если не заполнено, выбираем все партии;
//	* СтранаПроисхожденния (Справочники.СтраныМира) - если не заполнено, выбираем по любой стране;
//
Функция ПолучитьМассивИспользуемыхНомеровГТД(УсловияОтбора) Экспорт
	
	Если НЕ (УсловияОтбора.Свойство("Номенклатура")
		И ЗначениеЗаполнено(УсловияОтбора.Номенклатура)) Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("Выбрать Различные РегистрГТД.НомерГТД КАК НомерГТД Из РегистрНакопления.ЗапасыВРазрезеГТД КАК РегистрГТД Где 
	|&УсловиеОрганизации
	|И РегистрГТД.Номенклатура = &Номенклатура
	|И &УсловиеХарактеристики
	|И &УсловиеПартии
	|И &УсловиеСтраныПроисхождения");
	
	Запрос.УстановитьПараметр("Номенклатура", УсловияОтбора.Номенклатура);
		
	Если УсловияОтбора.Свойство("Организация")
		И ЗначениеЗаполнено(УсловияОтбора.Организация) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизации", "РегистрГТД.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(УсловияОтбора.Организация));
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОрганизации", "Истина");
		
	КонецЕсли;
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики")
		И УсловияОтбора.Свойство("Характеристика") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеХарактеристики", "РегистрГТД.Характеристика = &Характеристика");
		Запрос.УстановитьПараметр("Характеристика", УсловияОтбора.Характеристика);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеХарактеристики", "Истина");
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии")
		И УсловияОтбора.Свойство("Партия") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПартии", "РегистрГТД.Партия = &Партия");
		Запрос.УстановитьПараметр("Партия", УсловияОтбора.Партия);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПартии", "Истина");
		
	КонецЕсли;
		
	Если УсловияОтбора.Свойство("СтранаПроисхождения")
		И ЗначениеЗаполнено(УсловияОтбора.СтранаПроисхождения) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтраныПроисхождения", "РегистрГТД.СтранаПроисхождения = &СтранаПроисхождения");
		Запрос.УстановитьПараметр("СтранаПроисхождения", УсловияОтбора.СтранаПроисхождения);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтраныПроисхождения", "Истина");
		
	КонецЕсли;
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаРезультатаЗапроса.ВыгрузитьКолонку("НомерГТД");
	
КонецФункции // ПолучитьМассивИспользуемыхНомеровГТД()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
